## 데이터처리를 위한 Pandas
### http://pandas.pydata.org

In [2]:
import pandas as pd
import numpy as np

#### 구조적 데이터 생성하기 pd.Series()

In [3]:
s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
s1.values

array([10, 20, 30, 40, 50])

In [13]:
# 여러가지 자료형태 같이 사용가능
pd.Series(['a','b','c',1,2,3])

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

#### 비어있는값 np.nan

In [17]:
pd.Series([np.nan, 10, 30])

0     NaN
1    10.0
2    30.0
dtype: float64

#### Series 데이터 생성시 index 추가

In [14]:
index_dt = ['2017','2018','2019']
s2 = pd.Series([300,200,400], index=index_dt)
s2

2017    300
2018    200
2019    400
dtype: int64

In [15]:
s3 = pd.Series({"수학":40,"영어":20,"과학":80,"역사":20})
s3

수학    40
영어    20
과학    80
역사    20
dtype: int64

#### 날짜 자동생성 pd.data_range(start, end, periods, freq='D')
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html

In [8]:
pd.date_range(start="2019-01-01", end="2019-01-10")

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10'],
              dtype='datetime64[ns]', freq='D')

In [10]:
pd.date_range(start="2019-01-01", periods=30)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
               '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
               '2019-01-29', '2019-01-30'],
              dtype='datetime64[ns]', freq='D')

In [12]:
pd.date_range(start="2019-01-01", periods=7, freq="3D")

DatetimeIndex(['2019-01-01', '2019-01-04', '2019-01-07', '2019-01-10',
               '2019-01-13', '2019-01-16', '2019-01-19'],
              dtype='datetime64[ns]', freq='3D')

In [13]:
pd.date_range(start="2019-01-01", periods=7, freq="M")

DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30',
               '2019-05-31', '2019-06-30', '2019-07-31'],
              dtype='datetime64[ns]', freq='M')

#### 데이터프레임 생성 pd.DataFrame()
#### 표와같은 2차원 데이터 처리를 위한 데이터프레임

In [16]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

#### 인덱스와 칼럼지정

In [17]:
index_dt = ['2017','2018','2019']
column = ["서울","인천","부산"]
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index = index_dt, columns=column)

      서울  인천  부산
2017   1   2   3
2018   4   5   6
2019   7   8   9

In [21]:
datatb = {'연도':[2017, 2018, 2019],
                '인구':[20, 30, 40]}

datadt = pd.DataFrame(datatb)
datadt

     연도  인구
0  2017  20
1  2018  30
2  2019  40

In [22]:
datadt.index

RangeIndex(start=0, stop=3, step=1)

In [23]:
datadt.columns

Index(['연도', '인구'], dtype='object')

In [24]:
datadt.values

array([[2017,   20],
       [2018,   30],
       [2019,   40]])

#### 데이터 연산

In [25]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([2,3,2,3,2])

In [26]:
s1 + s1

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [27]:
s1 * s1

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [28]:
s1 / s1

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
dtype: float64

In [29]:
s1 = pd.Series([1,2,3,4,5,6,7,8])
s2 = pd.Series([2,3,2,3,2])
s1 + s2

0    3.0
1    5.0
2    5.0
3    7.0
4    7.0
5    NaN
6    NaN
7    NaN
dtype: float64

#### 데이터 프레임끼리 연산

In [33]:
table_1 = {"A":[1,2,3,4,5],
                "B":[5,6,7,8,9]}

dt_1 = pd.DataFrame(table_1)

table_2 = {"A":[3,4,3,4],
                "B":[3,4,3,4]}

dt_2 = pd.DataFrame(table_2)

dt_2

   A  B
0  3  3
1  4  4
2  3  3
3  4  4

In [34]:
dt_1 + dt_2

     A     B
0  4.0   8.0
1  6.0  10.0
2  6.0  10.0
3  8.0  12.0
4  NaN   NaN

In [35]:
table_3 = {"여자":[300,400,350,210],
                "남자":[200,500,550,430]}

index_list = [2012,2013,2014,2015]

dt_3 = pd.DataFrame(table_3, index = index_list)
dt_3

       여자   남자
2012  300  200
2013  400  500
2014  350  550
2015  210  430

In [36]:
dt_3.sum()

여자    1260
남자    1680
dtype: int64

In [37]:
dt_3.mean()

여자    315.0
남자    420.0
dtype: float64

In [38]:
dt_3.std()

여자     81.034972
남자    154.704018
dtype: float64

In [39]:
dt_3.sum(axis=1)

2012    500
2013    900
2014    900
2015    640
dtype: int64

In [40]:
dt_3.describe()

               여자          남자
count    4.000000    4.000000
mean   315.000000  420.000000
std     81.034972  154.704018
min    210.000000  200.000000
25%    277.500000  372.500000
50%    325.000000  465.000000
75%    362.500000  512.500000
max    400.000000  550.000000

#### 데이터를 원하는 대로 선택

In [43]:
dt_3.head(2)

       여자   남자
2012  300  200
2013  400  500

In [44]:
dt_3.tail(2)

       여자   남자
2014  350  550
2015  210  430

In [45]:
dt_3[1:3]

       여자   남자
2013  400  500
2014  350  550

#### 인덱스로 데이터 가져오기 loc[]

In [46]:
dt_3.loc[2014]

여자    350
남자    550
Name: 2014, dtype: int64

In [48]:
dt_3.loc[2014:2016]

       여자   남자
2014  350  550
2015  210  430

In [49]:
dt_3['남자']

2012    200
2013    500
2014    550
2015    430
Name: 남자, dtype: int64

In [50]:
dt_3['남자'][2013]

500

In [51]:
dt_3['남자'][1:3]

2013    500
2014    550
Name: 남자, dtype: int64

#### 행과 열을 바꾸는 전치

In [52]:
dt_3.T

    2012  2013  2014  2015
여자   300   400   350   210
남자   200   500   550   430

#### 데이터 통합하기

In [53]:
add_table = {"여자":[440,230],
                    "남자":[250,100]}

add_dt = pd.DataFrame(add_table, index=[2016,2017])

dt_3.append(add_dt)

       여자   남자
2012  300  200
2013  400  500
2014  350  550
2015  210  430
2016  440  250
2017  230  100

In [54]:
dt_3 = pd.DataFrame(table_3, index = index_list)

add_column_dt = pd.DataFrame({"외국인":[300,200,500,400]}, index = index_list)
dt_3.join(add_column_dt)

       여자   남자  외국인
2012  300  200  300
2013  400  500  200
2014  350  550  500
2015  210  430  400

### CSV 파일읽기

In [55]:
cvs_data = pd.read_csv("report.txt", sep="\t")
cvs_data

      기간     연령별    미혼모    미혼부
0   2015       계  4,510  1,613
1   2015   20세미만     45     10
2   2015  20~24세    268     45
3   2015  25~29세    399     61
4   2015  30~34세    646    187
5   2015  35~39세    887    315
6   2015  40~44세    926    361
7   2015  45~49세    730    313
8   2015   50세이상    609    321
9   2016       계  4,344  1,374
10  2016   20세미만     56      X
11  2016  20~24세    280     45
12  2016  25~29세    406     59
13  2016  30~34세    643    146
14  2016  35~39세    866    266
15  2016  40~44세    835    287
16  2016  45~49세    689    291
17  2016   50세이상    569    277
18  2017       계  4,510  1,613
19  2017   20세미만     45     10
20  2017  20~24세    268     45
21  2017  25~29세    399     61
22  2017  30~34세    646    187
23  2017  35~39세    887    315
24  2017  40~44세    926    361
25  2017  45~49세    730    313
26  2017   50세이상    609    321

In [56]:
excel_data = pd.read_excel("report.xls")
excel_data

ImportError: Install xlrd >= 0.9.0 for Excel support